[
    {
      "id": 1,
      "title": "Guitarra Eléctrica",
      "instrument": "guitarra",
      "instructor": "Carlos Santana",
      "duration": "8 semanas",
      "level": "Intermedio",
      "description": "Domina la guitarra eléctrica con técnicas avanzadas y estilos modernos.",
      "programa": "Nivel Principiante: Introducción a la guitarra eléctrica: partes y mantenimiento. Afinación y posturas correctas. Primeros acordes y progresiones básicas. Técnica de púa: alternado, downpicking. Lectura de tablaturas. Riffs básicos y canciones sencillas. Ejercicios de coordinación y ritmo. Nivel Intermedio: Escalas pentatónicas y modos. Técnicas de bending, slide, hammer-ons y pull-offs. Power chords y armonías. Introducción a la improvisación. Ritmos y patrones de rock y blues. Pedales y efectos: distorsión, delay, reverb. Ejecución de solos sencillos. Nivel Avanzado: Técnicas avanzadas: tapping, sweep picking. Dominio de escalas modales y arpegios. Análisis y ejecución de solos complejos. Estilos avanzados: metal, jazz fusión, funk. Composición y arreglos para guitarra eléctrica. Uso avanzado de efectos y equipos.",
      "image": "https://images.pexels.com/photos/165971/pexels-photo-165971.jpeg"
    },
    {
      "id": 2,
      "title": "Guitarra Clásica",
      "instrument": "guitarra",
      "instructor": "Andrés Segovia",
      "duration": "12 semanas",
      "level": "Avanzado",
      "description": "Aprende los fundamentos y técnicas de la guitarra clásica.",
      "programa": "Nivel Principiante: Presentación de la guitarra clásica: afinación, partes, postura. Ejercicios básicos de digitación y coordinación mano derecha/izquierda. Lectura de partituras simples. Primeros acordes y melodías sencillas. Ejercicios básicos de arpegios. Nivel Intermedio: Escalas mayores y menores en diferentes posiciones. Técnicas de arpegio avanzadas. Estudio de obras clásicas de dificultad moderada (Carulli, Sor). Ejercicios de mano derecha: apoyado y tirando. Introducción al trémolo y técnicas de rasgueo. Nivel Avanzado: Interpretación de piezas complejas (Bach, Villa-Lobos, Tarrega). Técnicas avanzadas: ligado, vibrato, armónicos. Estudio del contrapunto y polifonía. Desarrollo de la expresividad y dinámica en la interpretación. Repertorio avanzado y preparación para recitales.",
      "image": "https://images.pexels.com/photos/164697/pexels-photo-164697.jpeg"
    },
    {
      "id": 3,
      "title": "Guitarra Popular",
      "instrument": "guitarra",
      "instructor": "Juan Pérez",
      "duration": "6 semanas",
      "level": "Principiante",
      "description": "Iníciate en la guitarra popular y aprende tus canciones favoritas.",
      "programa": "Nivel Principiante: Introducción a la guitarra flamenca: postura y técnicas básicas. Principios del rasgueo y pulgar flamenco. Introducción a los palos flamencos: tangos, rumba. Acordes básicos y ritmos de compás. Primeras falsetas sencillas. Nivel Intermedio: Estudio de palos más complejos: bulerías, soleá. Técnica de picado y alzapúa. Desarrollo de falsetas intermedias. Trabajo rítmico con palmas y contratiempos. Introducción al acompañamiento del cante flamenco. Nivel Avanzado: Palos complejos: alegrías, seguiriyas, fandangos. Técnicas avanzadas de picado y trémolo flamenco. Composición de falsetas y variaciones propias. Acompañamiento avanzado para baile y cante. Interpretación de repertorio flamenco clásico y moderno.",
      "image": "https://images.pexels.com/photos/1407322/pexels-photo-1407322.jpeg"
    },
    {
      "id": 4,
      "title": "Introducción al Piano",
      "instrument": "piano",
      "instructor": "María González",
      "duration": "8 semanas",
      "level": "Principiante",
      "description": "Aprende los conceptos básicos del piano y comienza a tocar melodías sencillas.",
      "programa": "Introducción al Piano (Nivel Principiante): Conocimiento del instrumento: partes, postura, digitación. Lectura básica de partituras: claves de sol y fa. Escalas mayores simples. Ejecución de melodías sencillas con acordes. Coordinación de ambas manos.",
      "image": "https://images.pexels.com/photos/1246437/pexels-photo-1246437.jpeg"
    },
    {
      "id": 5,
      "title": "Piano Intermedio",
      "instrument": "piano",
      "instructor": "Luis Hernández",
      "duration": "10 semanas",
      "level": "Intermedio",
      "description": "Mejora tus habilidades pianísticas y domina piezas más complejas.",
      "programa": "Piano Intermedio: Ejecución de escalas mayores y menores. Introducción a los acordes séptimos y disminuidos. Armonización de melodías y patrones de acompañamiento. Ejecución de piezas clásicas de nivel medio (Mozart, Schumann). Desarrollo de la expresión dinámica.",
      "image": "https://images.pexels.com/photos/2378209/pexels-photo-2378209.jpeg"
    },
    {
      "id": 6,
      "title": "Piano Avanzado",
      "instrument": "piano",
      "instructor": "Ana López",
      "duration": "12 semanas",
      "level": "Avanzado",
      "description": "Perfecciona tu técnica y prepárate para conciertos profesionales.",
      "programa": "Piano Avanzado: Interpretación de obras complejas (Chopin, Beethoven). Técnica avanzada: trinos, arpegios rápidos, polifonía. Estudio de la teoría armónica y modulación. Preparación de repertorio para recitales. Improvisación y acompañamiento avanzado.",
      "image": "https://images.pexels.com/photos/1293551/pexels-photo-1293551.jpeg"
    },
    {
      "id": 7,
      "title": "Percusiones",
      "instrument": "bateria",
      "instructor": "Miguel Ángel",
      "duration": "6 semanas",
      "level": "Principiante",
      "description": "Introducción a las percusiones y ritmos básicos.",
      "programa": "Nivel Principiante: Introducción a las percusiones: tipos de instrumentos (congas, bongós, djembé). Técnicas básicas de golpeo y postura. Ritmos básicos latinos y africanos. Coordinación de manos y patrones sencillos. Nivel Intermedio: Ritmos más complejos (son, samba, cumbia, flamenco). Uso de otros instrumentos de percusión: cajón, timbales. Combinación de patrones y improvisación básica. Acompañamiento de diferentes estilos musicales. Nivel Avanzado: Ejecución de polirritmos avanzados. Técnica avanzada en varios instrumentos de percusión. Desarrollo de solos y acompañamiento en grupos. Composición de patrones rítmicos complejos.",
      "image": "https://images.pexels.com/photos/65717/pexels-photo-65717.jpeg"
    },
    {
      "id": 8,
      "title": "Introducción a la Batería",
      "instrument": "bateria",
      "instructor": "Roberto Martínez",
      "duration": "8 semanas",
      "level": "Principiante",
      "description": "Aprende a tocar la batería desde cero.",
      "programa": "Batería (Nivel Intermedio): Conocimiento de la batería: partes, montaje, afinación. Técnicas básicas de baquetas y coordinación pies/manos. Ejecución de patrones básicos (rock, pop). Introducción a la lectura rítmica.",
      "image": "https://images.pexels.com/photos/995301/pexels-photo-995301.jpeg"
    },
    {
      "id": 9,
      "title": "Batería Avanzada",
      "instrument": "bateria",
      "instructor": "Fernando Díaz",
      "duration": "10 semanas",
      "level": "Avanzado",
      "description": "Domina técnicas avanzadas y estilos complejos en la batería.",
      "programa": "Batería Avanzada: Desarrollo de independencia y coordinación avanzada. Ejecución de patrones complejos (jazz, metal, funk). Uso de dobles pedales, ghost notes, fills. Improvisación y solos de batería. Desarrollo de técnicas avanzadas: moeller, rudimentos complejos.",
      "image": "https://images.pexels.com/photos/164967/pexels-photo-164967.jpeg"
    },
    {
      "id": 10,
      "title": "Introducción al Canto",
      "instrument": "tecnica-vocal",
      "instructor": "Sofía Ruiz",
      "duration": "6 semanas",
      "level": "Principiante",
      "description": "Descubre tu voz y aprende técnicas básicas de canto.",
      "programa": "Introducción al Canto (Nivel Principiante): Ejercicios de respiración y postura. Introducción al control vocal y colocación de la voz. Escalas básicas y ejercicios de afinación. Proyección vocal y dicción.",
      "image": "https://images.pexels.com/photos/7086299/pexels-photo-7086299.jpeg"
    },
    {
      "id": 11,
      "title": "Bel Canto",
      "instrument": "tecnica-vocal",
      "instructor": "Valentina Moreno",
      "duration": "12 semanas",
      "level": "Intermedio",
      "description": "Perfecciona tu técnica vocal con el estilo del bel canto.",
      "programa": "Bel Canto (Nivel Avanzado): Técnica vocal clásica: respiración diafragmática y emisión vocal. Ejercicios de apoyo y control del vibrato. Estudio de arias clásicas y repertorio operístico. Expresión dramática y manejo del escenario.",
      "image": "https://images.pexels.com/photos/7567423/pexels-photo-7567423.jpeg"
    },
    {
      "id": 12,
      "title": "Canto Popular",
      "instrument": "tecnica-vocal",
      "instructor": "Daniela Fernández",
      "duration": "8 semanas",
      "level": "Intermedio",
      "description": "Aprende a interpretar canciones populares y mejorar tu presencia escénica.",
      "programa": "Canto Popular (Nivel Intermedio): Técnicas de canto en estilos populares: pop, jazz, rock. Uso del micrófono y técnicas de interpretación escénica. Improvisación vocal y scat. Ejercicios de fraseo y dinámicas en canciones populares.",
      "image": "https://images.pexels.com/photos/5648357/pexels-photo-5648357.jpeg"
    }
  ]  